# Chapter 5. Getting Started with pandas
<a id='index'></a>

### Table of Content
- [5.1 Introduction to pandas Data](#51)
    - [5.1.1 Series](#511)
    - [5.1.2 DataFrame](#512)
    - [5.1.3 Index Objects](#513)
- [5.2 Essential Functionality](#52)
    - [5.2.1 Reindexing](#521)
    - [5.2.2 Dropping Entries from an Axis](#522)
    - [5.2.3 Indexing, Selection, and Filtering](#523)
    - [5.2.4 Integer Indexes](#524)
    - [5.2.5 Arithmetic and Data Alignment](#525)
    - [5.2.6 Function Application and Mapping](#526)
    - [5.2.7 Sorting and Ranking](#527)
    - [5.2.8 Axis Indexes with Duplicate Labels](#528)
- [5.3 Summarizing and Computing Descriptive Statistics](#53)
    - [5.3.1 Correlation and Covariance](#531)
    - [5.3.2 Unique Values, Value Counts, and Membership](#532)

In [3]:
import numpy as np
import pandas as pd

## 5.1 Introduction to pandas Data
<a id='51'></a>

### 5.1.1 Series
<a id='511'></a>

In [4]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3])

In [6]:
obj.index  # like range(4)

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
# Here ['c', 'a', 'd'] is interpreted as a list of indices, even though it contains strings instead of integers.
obj2[['c', 'a', 'd']]

c    3
a   -5
d    4
dtype: int64

In [10]:
# Another way to think about a Series is as a fixed-length, ordered dict, 
# as it is a mapping of index values to data values. 
'b' in obj2

True

In [11]:
'e' in obj2

False

In [14]:
# Both the Series object itself and its index have a name attribute, 
# which integrates with other key areas of pandas functionality
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [18]:
# Name the table and index
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [20]:
# A Series's index can be altered
obj.index=['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### 5.1.2 DataFrame
<a id='512'></a>

In [22]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [35]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [36]:
frame2['debt'] = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [37]:
try:
    del frame2['eastern']
except:
    print("Easter has been deleted already")
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [39]:
# If a DataFrameâ€™s index and columns have their name attributes set, these will also be displayed:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

frame3 = pd.DataFrame(pop)

frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

### 5.1.3 Index Objects
<a id='513'></a>

In [45]:
# Index objects are immutable and thus can't be modified by the user
try:
    frame3.index[0] = 'd'
except TypeError as e:
    print(e)

Index does not support mutable operations

## 5.2 Essential Functionality
<a id='52'></a>
### 5.2.1 Reindexing
<a id='521'></a>
Calling **reindex** on this Series rearranges the data according to the new index, introducing missing values if any index values were not already present:

In [46]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [48]:
obj2 = obj.reindex(['a', 'b', 'c', 'd'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

<hr>
For ordered data like time series, it may be desirable to do some interpolation or filling of values when reindexing

The ***method*** option could help

In [49]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [50]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

The columns can be reindexed with the **colunns** keyword

In [4]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [5]:
# Reindex more succinctly by label-indexing with ***loc***
frame.loc[['a', 'c', 'd'], states]

NameError: name 'states' is not defined

### 5.2.2 Dropping Entries from an Axis
<a id='522'></a>
*Drop method will <span style="color:red;">return a new object*</span>
<hr>
Drop can manupulate an object *in-place* without returning a new object

In [64]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj.drop('c')
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [65]:
obj.drop('c', inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

### 5.2.3 Indexing, Selection, and Filtering
<a id='523'></a>

In [66]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [67]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [68]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [69]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

<hr>

#### Selection with loc and iloc

In [70]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [71]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [72]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [73]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

### 5.2.4 Integer Indexes
<a id='524'></a>
Null

### 5.2.5 Arithmetic and Data Alignment
<a id='525'></a>

In [74]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})

In [75]:
df1

   A
0  1
1  2

In [76]:
df2

   B
0  3
1  4

In [77]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

<hr>

In [82]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [83]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [84]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [79]:
# Using the add method on df1, I pass df2 and an argument to fill_value
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [80]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

<hr>
***Operations between DataFrame and Series***

In [85]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [86]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [88]:
# By default, arithmetic between DataFrame and Series matches the index of 
# the Series on the DataFrameâ€™s columns, broadcasting down the rows:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

If you want to instead broadcast over the columns, matching on the rows, you have to use one of the arithmetic methods
### 5.2.6 Function Application and Mapping
<a id='526'></a>

In [93]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    1.907158 -1.081336 -1.397930
Ohio    0.245185 -1.269262  0.027880
Texas  -0.953527  0.903220 -0.807938
Oregon  0.159073  0.253743  0.107207

In [94]:
np.abs(frame)

               b         d         e
Utah    1.907158  1.081336  1.397930
Ohio    0.245185  1.269262  0.027880
Texas   0.953527  0.903220  0.807938
Oregon  0.159073  0.253743  0.107207

In [96]:
# In lambda, x can be an array or Series
f = lambda x: x.max() - x.min()
frame.apply(f)

b    2.860685
d    2.172482
e    1.505137
dtype: float64

In [97]:
frame.apply(f, axis='columns')

Utah      3.305087
Ohio      1.514447
Texas     1.856747
Oregon    0.146535
dtype: float64

In [98]:
# It can also return a Series with multiple values
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -0.953527 -1.269262 -1.397930
max  1.907158  0.903220  0.107207

In [101]:
# Element-wise Python function can be used
format = lambda x: '%.2f' % x
frame.applymap(format)

# The reason for the name applymap is that Series has a map method for applying an element-wise function

            b      d      e
Utah     1.91  -1.08  -1.40
Ohio     0.25  -1.27   0.03
Texas   -0.95   0.90  -0.81
Oregon   0.16   0.25   0.11

### 5.2.7 Sorting and Ranking
<a id='527'></a>

In [102]:
# Sort by values
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [103]:
# When sorting a DataFrame, you can use the data in one or more columns as the sort keys
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [104]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [105]:
# To sort by multiple columns, pass a list of names
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

Ranking assigns ranks from one through the number of valid data points in an array

In [106]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [108]:
# Ranks can also be assigned according to the order in which theyâ€™re observed in the data
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

### 5.2.8 Axis Indexes with Duplicate Labels
<a id='528'></a>

In [112]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [115]:
obj['a']

a    0
a    1
dtype: int64

In [116]:
# The indexâ€™s is_unique property can tell you whether its labels are unique or not
obj.index.is_unique

False

## Summarizing and Computing Descriptive Statistics
<a id='53'></a>
pandas objects are equipped with a set of common mathematical and statistical methods. Most of these fall into the category of reductions or summary statistics, methods that extract a single value (like the sum or mean) from a Series or a Series of values from the rows or columns of a DataFrame. Compared with the similar methods found on NumPy arrays, they have built-in handling for missing data.

In [118]:
df = pd.DataFrame([[1.4, np.NaN], [7.1, -4.5], [np.NaN, np.NaN], [0.75, -1.3]], 
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [120]:
# return indirect statistics like the index value where the minimum or maximum values are attained
df.idxmax()

one    b
two    d
dtype: object

In [121]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

### 5.3.1 Correlation and Covariance
<a id='531'></a>

In [128]:
returns = pd.DataFrame({'AAPL': [-0.000680, -0.000681, -0.002979, -0.000512, -0.003930],
                        'GOOG': [0.001837, 0.019616, 0.007846, -0.005662, 0.003011],
                        'IBM': [0.002072, -0.026168, 0.003583, 0.001719, -0.012474],
                        'MSFT': [-0.003483, 0.007690, -0.002255, -0.004867, 0.042096]}, 
                      index=['2016-10-17','2016-10-18', '2016-10-19','2016-10-20','2016-10-21'])
returns

                AAPL      GOOG       IBM      MSFT
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005662  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [129]:
returns['MSFT'].corr(returns['IBM'])

-0.49501819289534821

In [131]:
returns['MSFT'].cov(returns['IBM'])

-0.00012624448409999999

In [132]:
returns.MSFT.corr(returns.IBM)

-0.49501819289534821

In [133]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000 -0.001865 -0.012686 -0.718659
GOOG -0.001865  1.000000 -0.751745  0.097777
IBM  -0.012686 -0.751745  1.000000 -0.495018
MSFT -0.718659  0.097777 -0.495018  1.000000

In [134]:
returns.cov()

              AAPL          GOOG           IBM      MSFT
AAPL  2.520735e-06 -2.765720e-08 -2.596830e-07 -0.000023
GOOG -2.765720e-08  8.720573e-05 -9.050982e-05  0.000018
IBM  -2.596830e-07 -9.050982e-05  1.662283e-04 -0.000126
MSFT -2.256967e-05  1.806125e-05 -1.262445e-04  0.000391

Using DataFrameâ€™s corrwith method, you can compute pairwise correlations between a DataFrameâ€™s columns or rows with another Series or DataFrame.

In [135]:
returns.corrwith(returns.IBM)

AAPL   -0.012686
GOOG   -0.751745
IBM     1.000000
MSFT   -0.495018
dtype: float64

### 5.3.2 Unique Values, Value Counts, and Membership
<a id='532'></a>

In [137]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [138]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [139]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [143]:
# isin performs a vectorized set membership check and can be useful in filtering a dataset
# down to a subset of values in a Series or column in a DataFrame
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [144]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

Related to ***isin*** is the ***Index.get_indexer*** method, which gives you an index array from an array of possibly non-distinct values into another array of distinct values

In [145]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])

pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2])

In some cases, you may want to compute a histogram on multiple related columns in a DataFrame. Hereâ€™s an example:

In [147]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [151]:
result = data.apply(pd.value_counts)
#result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [152]:
pd.value_counts??

[Back to Top](#index)